RhinoInside.Revit API Documentation
GeometryEncoder.ToPoint Method
 Converts the specified Rhino.Geometry.Point to an equivalent of Autodesk.Revit.DB.Point.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Point ToPoint(
	this Rhino.Geometry.Point point
)
@staticmethod
def ToPoint(
	point: Rhino.Geometry.Point
) -> Autodesk.Revit.DB.Point
Parameters
point
Type: Rhino.Geometry.Point
Rhino point to convert.
Return Value
Type: Autodesk.Revit.DB.Point
Revit Point that is equivalent to the provided Rhino point.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Point. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPoint(Point) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Point revitPoint = rhinoPoint.ToPoint();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_point = rhino_point.ToPoint()    # type: DB.Point
 Using ToPoint(Point) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Point revitPoint = GeometryEncoder.ToPoint(rhinoPoint);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_point = GE.ToPoint(rhino_point)    # type: DB.Point
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace